Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыЦен</name>
  </enumValues>
  <enumValues>
    <name>ЦеныНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковокДокументов</name>
  </enumValues>
  <enumValues>
    <name>ДокументыАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументовАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>СерииДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыАлгоритмов/SUI_ТипыАлгоритмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыАлгоритмов</name>
  <enumValues>
    <name>Simple</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/Forms/ДополнительныеНастройки_ШтрихкодыУпаковок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок;
	
	ЗагрузитьДанныеОписанияПеременных();
	
	ЗагрузитьДополнительныеНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображенияЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВопрос(
			ПолучитьОповещениеСохраненияНастроек(), 
			НСтр("ru = 'Дополнительные настройки были модифицированы.
			|Сохранить настройки?'"), 
			РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипАлгоритмаНормализацииЗначенияШтрихкодаПриИзменении(Элемент)
	ОбновитьОтображенияЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОписаниеПеременныхАлгоритмаНормализацииШтрихкодаУпаковки

&НаКлиенте
Процедура ОписаниеПеременныхАлгоритмаНормализацииШтрихкодаУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьОписаниеПеременнойПриВыборе(Элемент, Поле);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОписаниеПеременныхАлгоритмаСозданияШтрихкодаУпаковки

&НаКлиенте
Процедура ОписаниеПеременныхАлгоритмаСозданияШтрихкодаУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьОписаниеПеременнойПриВыборе(Элемент, Поле);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	ВыполнитьОбработкуОповещения(ПолучитьОповещениеСохраненияНастроек(), КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	ВыполнитьОбработкуОповещения(ПолучитьОповещениеСохраненияНастроек(Ложь), КодВозвратаДиалога.Да);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДополнительныеНастройки()
	
	ТипыОписания = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Тип("Структура"), 
		Тип("ФиксированнаяСтруктура"));
		
	ОписаниеТипаСтруктура = Новый ОписаниеТипов(ТипыОписания);
	
	ДополнительныеНастройки = ОписаниеТипаСтруктура.ПривестиЗначение(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(ТаблицаИнтеграции, Ложь));
	
	Возврат ?(ДополнительныеНастройки = Неопределено, Новый Структура(), ДополнительныеНастройки);
	
КонецФункции

&НаСервере
Процедура СохранитьДополнительныеНастройки()
	
	SUI_НастройкиМетаданныхСервер.СохранитьДополнительныеНастройки(ТаблицаИнтеграции, ПолучитьДополнительныеНастройкиДляСохранения());
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОповещениеСохраненияНастроек(ЗакрытиеФормы = Истина)
	
	ПараметрыОповещения =  Новый Структура();
	
	Если ЗакрытиеФормы Тогда
		ПараметрыОповещения.Вставить("ЗакрытиеФормы");
	КонецЕсли;
	
	Возврат Новый ОписаниеОповещения("СохранениеНастроекПослеПодтверждения", ЭтотОбъект, ПараметрыОповещения);
	
КонецФункции

&НаКлиенте
Процедура СохранениеНастроекПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьДополнительныеНастройки();
		//@skip-check wrong-string-literal-content
		ОписаниеОповещенияОЗакрытии.Модуль["НастройкиЗаписаны"] = Истина;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗакрытиеФормы") Тогда
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
		КонецЕсли;
		
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДеревоОписанияПеременных()
	
	Дерево = Новый ДеревоЗначений();
	
	Дерево.Колонки.Добавить("Имя", 		ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Тип", 		ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Дерево;
	 
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСтрокуВДеревоОписанияПеременных(Приемник, ИмяПеременной, Знач ТипПеременной, ОписаниеПеременной)
	
	ТипЗначенияТипПеременной = ТипЗнч(ТипПеременной);
	Если ТипЗначенияТипПеременной = Тип("Тип") Тогда
		ТипПеременной = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипПеременной));
	ИначеЕсли ТипЗначенияТипПеременной = Тип("Строка") Тогда
		
		Если ПустаяСтрока(ТипПеременной) Тогда
			ТипПеременной = НСтр("ru = 'Произвольный'");
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияТипПеременной <> Тип("ОписаниеТипов") Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимый тип'");
	КонецЕсли;
	
	НоваяСтрокаПриемника = Приемник.Строки.Добавить();
	
	НоваяСтрокаПриемника.Имя 		= СокрЛП(ИмяПеременной);
	НоваяСтрокаПриемника.Тип 		= Строка(ТипПеременной);
	НоваяСтрокаПриемника.Описание 	= СокрЛП(ОписаниеПеременной);
	
	Возврат НоваяСтрокаПриемника;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеПеременнойПриВыборе(Элемент, Поле)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(Поле.Имя, "Описание") Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Описание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьДополнительныеНастройки()
	
	ДополнительныеНастройки = ПолучитьДополнительныеНастройки();
	
	// Алгоритм нормализации штрихкода упаковки
	ТипАлгоритмаНормализацииЗначенияШтрихкода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"АлгоритмНормализацииЗначенияШтрихкода.Тип", Перечисления.SUI_ТипыАлгоритмов.Simple, Тип("ПеречислениеСсылка.SUI_ТипыАлгоритмов"));
	АлгоритмНормализацииШтрихкодаУпаковки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"АлгоритмНормализацииЗначенияШтрихкода.Алгоритм", "", Тип("Строка"));
		
	// Алгоритм создания штрихкода упаковки
	АлгоритмСозданияШтрихкодаУпаковки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"АлгоритмСозданияШтрихкодаУпаковки.Алгоритм", "", Тип("Строка"));
	
	Если Не ЗначениеЗаполнено(ТипАлгоритмаНормализацииЗначенияШтрихкода) Тогда
		ТипАлгоритмаНормализацииЗначенияШтрихкода = Перечисления.SUI_ТипыАлгоритмов.Simple;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительныеНастройкиДляСохранения()
	
	ДополнительныеНастройки = Новый Структура();
	
	// Алгоритм нормализации штрихкода упаковки
	ДополнительныеНастройки.Вставить("АлгоритмНормализацииЗначенияШтрихкода", Новый Структура());
	ДополнительныеНастройки.АлгоритмНормализацииЗначенияШтрихкода.Вставить("Тип", ТипАлгоритмаНормализацииЗначенияШтрихкода);
	ДополнительныеНастройки.АлгоритмНормализацииЗначенияШтрихкода.Вставить("Алгоритм", АлгоритмНормализацииШтрихкодаУпаковки);
	
	// Алгоритм создания штрихкода упаковки
	ДополнительныеНастройки.Вставить("АлгоритмСозданияШтрихкодаУпаковки", Новый Структура());
	ДополнительныеНастройки.АлгоритмСозданияШтрихкодаУпаковки.Вставить("Алгоритм", АлгоритмСозданияШтрихкодаУпаковки);
	
	Возврат Новый ФиксированнаяСтруктура(ДополнительныеНастройки);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеОписанияПеременных()
	
	// Описание переменных нормализации штрихкода упаковок
	ЗначениеВРеквизитФормы(ПолучитьДеревоОписаниеПеременныхНормализацииШтрихкодаУпаковок(), 
		"ОписаниеПеременныхАлгоритмаНормализацииШтрихкодаУпаковки");
	
	// Описание переменных создания штрихкода упаковок
	ЗначениеВРеквизитФормы(ПолучитьДеревоОписаниеПеременныхСозданияШтрихкодаУпаковок(), 
		"ОписаниеПеременныхАлгоритмаСозданияШтрихкодаУпаковки");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДеревоОписаниеПеременныхНормализацииШтрихкодаУпаковок()
	
	Дерево = ПолучитьДеревоОписанияПеременных();
	
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "ЗначениеШтрихкода", Тип("Строка"), НСтр("ru = 'Значение штрихкода полученное из ТСД'"));
	
	Возврат Дерево;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДеревоОписаниеПеременныхСозданияШтрихкодаУпаковок()
	
	Дерево = ПолучитьДеревоОписанияПеременных();
	
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "ЗначениеШтрихкода", Тип("Строка"), НСтр("ru = 'Значение штрихкода полученное из ТСД'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "ШтрихкодУпаковки", "", НСтр("ru = 'Значение для передачи созданного штрихкода упаковки'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "Номенклатура", 	"", НСтр("ru = 'Номенклатура полученная из ТСД'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "Характеристика", 	"", НСтр("ru = 'Характеристика полученная из ТСД'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "Серия", 			"", НСтр("ru = 'Серия полученная из ТСД'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "Упаковка", 		"", НСтр("ru = 'Упаковка полученная из ТСД'"));
	ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "SSCC", 			"", НСтр("ru = 'SSCC полученный из ТСД'"));
	
	Возврат Дерево;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображенияЭлементовФормы()
	
	Если ТипАлгоритмаНормализацииЗначенияШтрихкода = ПредопределенноеЗначение("Перечисление.SUI_ТипыАлгоритмов.Simple") Тогда
		Элементы.ГруппаПроизвольныйАлгоритмНормализацииШтрихкодаУпаковки.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПроизвольныйАлгоритмНормализацииШтрихкодаУпаковки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
